// Expected: 2, 1
// Пояснення: 
// Це класичний приклад з фазами I/O. Ми читаємо файл, і код всередині колбеку починає виконуватись у фазі Poll.
// Одразу після фази Poll йде фаза Check. А setImmediate викликає свій колбек саме у фазі Check.
// Тільки після цього (на наступному витку Event Loop у фазі Timers) спрацює наш setTimeout! Тому '2' виведеться раніше за '1'.
// *Якби ці дві функції були у глобальному скоупі без fs.readFile, їх порядок виконання міг би бути випадковим через затримку ініціалізації NodeJS.

const fs = require('fs');

fs.readFile(__filename, () => {
    setTimeout(() => console.log('1'), 0); // 2
    setImmediate(() => console.log('2')); // 1
});
